// Տրված է տող։ Տպել տողի մեջ մտնող բոլոր փոքրատառերը։
// let x="AbCdIf"
// y=x.toLowerCase()
// for (let i=0; i<=x.length-1; i++) {
//     if (x[i]===y[i]) {
//         console.log(x[i]);
//     }
// }




// Տրված է ամբողջ թվերի հաջորդականություն։ Տպել այդ հաջորդականության դրական և կենտ տարրերի քանակը։
// let x=[-4,1,2,3,4,5,6,7,8,9,10]
// for (let i=0; i<=x.length-1; i++){
// if (x[i]>0&&x[i]%2===1) {
//     console.log(x[i]);
// }
// }


// Տրված է իրական թվերի հաջորդականություն։ Տպել այդ հաջորդականության մեծագույն տարրը և նրա կարգահամարը (index)։
// let x=[1,2,3,4,5,6,7,8,9,10,11]
// console.log( Math.max.apply(null,x) +" index"+ x.indexOf(Math.max.apply(null,x)));


// Գրել ֆունկցիա, որն արգումենտում ստանում է տող և վերադարձնում այդ տողի երկարությունը։
// let a ="Javascript"
// let i=0
// for (; i<=a.length-1; i++){
// }
// console.log(i);



// Տրված զանգվածի համար հաշվել զանգվածի էլեմենտների միջին թվաբանականը։
// let x=[1,2,3,4]
// let y=0
// for (let i = 0; i <x.length; i++) {
//    y+=x[i]
// }
// console.log( y/x.length );


// Գրել ծրագիր, որը զանգվածի բացասական էլեմենտները կտանի աջ կողմ, իսկ դրականները՝ ձախ։
// let x=[-1,2,4,-5,-2,3];
// let y=[];
// for (let i = 0; i < x.length; i++) {
//     if (x[i]<0) {
//         y.push(x[i])
//     }else{
//         y.unshift(x[i])
//     }
// }
// console.log(y);